<?php

//---------------------------------------------
// Language file used by mako\Validate
//---------------------------------------------

return array
(
	'validate.required'                 => 'Поле %1$ обязательно для заполнения.',
	'validate.min_length'               => 'Поле %1$s должно содержать не более %2$s <pluralize:%2$s>символа</pluralize>.',
	'validate.max_length'               => 'Поле %1$s должно содержать не менее %2$s <pluralize:%2$s>символа</pluralize>.',
	'validate.exact_length'             => 'Поле %1$s должно содержать %2$s <pluralize:%2$s>символ</pluralize>.',
	'validate.less_than'                => 'Значение поля %1$s должно быть меньше %2$s.',
	'validate.less_than_or_equal_to'    => 'Значение поля %1$s должно быть меньше или равно %2$s.',
	'validate.greater_than'             => 'Значение поля %1$s должно быть больше %2$s.',
	'validate.greater_than_or_equal_to' => 'Значение поля %1$s должно быть больше или равно %2$s.',
	'validate.between'                  => 'Значение поля %1$s должно находиться в пределах %2$s и %3$s.',
	'validate.match'                    => 'Значения полей %1$s и %2$s должны совпадать.',
	'validate.different'                => 'Значения полей %1$s и %2$s должны отличаться.',
	'validate.regex'                    => 'Значение поля %1$s не соответствует формату.',
	'validate.integer'                  => 'Поле %1$s должно содержать число.',
	'validate.float'                    => 'Поле %1$s должно содержать дробное число.',
	'validate.natural'                  => 'Поле %1$s должно содержать натуральное число.',
	'validate.natural_non_zero'         => 'Поле %1$s должно содержать натуральное число, не равное нулю.',
	'validate.hex'                      => 'Поле %1$s должно содержать шестнадцатеричное значение.',
	'validate.alpha'                    => 'Значение поля %1$s должно состоять из букв.',
	'validate.alpha_unicode'            => 'Значение поля %1$s должно состоять из букв.',
	'validate.alphanumeric'             => 'Значение поля %1$s должно состоять из букв и чисел.',
	'validate.alphanumeric_unicode'     => 'Значение поля %1$s должно состоять из букв и чисел.',
	'validate.alpha_dash'               => 'Значение поля %1$s должно состоять из букв, чисел, дефиса и подчеркивания.',
	'validate.alpha_dash_unicode'       => 'Значение поля %1$s должно состоять из букв, чисел, дефиса и подчеркивания.',
	'validate.email'                    => 'Поле %1$s должно содержать правильный адрес электронной почты.',
	'validate.email_domain'             => 'Поле %1$s должно содержать правильный адрес электронной почты',
	'validate.url'                      => 'Поле %1$s должно содержать правильный адрес веб-страницы.',
	'validate.ip'                       => 'Поле %1$s должно содержать правильный IP-адрес.',
	'validate.in'                       => 'Поле %1$s должно содержать одно из допустимых значений.',
	'validate.not_in'                   => 'Поле %1$s содержит недопустимое значение.',
	'validate.date'                     => 'Поле %1$s должно содержать правильную дату.',
	'validate.before'                   => 'Поле %1$s должно содержать дату до %3$s.',
	'validate.after'                    => 'Поле %1$s должно содержать дату после %3$s.',
	'validate.token'                    => 'Недопустимое значение ключа безопасности.',
	'validate.uuid'                     => 'Недопустимое значение уникального идентификатора.',
	'validate.unique'                   => '%1$s уже существует.',
	'validate.exists'                   => '%1$s не существует.',
);

/** -------------------- End of file --------------------**/